In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime

In [2]:
data=pd.read_csv('Customer_Sales_Transactional_Data_CSV.txt')

In [3]:
df=data.copy()

In [4]:
chicago_areas = ['Chicago-Aurora-Elgin-Joliet-Waukegan','Round Lake Beach-McHenry-Grayslake',
                'Kenosha, WI','Michigan City-LaPorte, IN-MI',
                'Kankakee-Bradley-Bourbonnais, IL',
                'DeKalb-Sycamore, IL','Woodstock, IL',
                'Morris, IL','Sandwich, IL',
                'Braidwood-Coal City, IL','Harvard, IL',
                'Lakes of the Four Seasons, IN','Lowell, IN',
                'Wilmington, IL','Manteno, IL',
                'Marengo, IL','Rensselaer, IN','Plano, IL','Genoa, IL',
                'Genoa City, WI-IL','Westville, IN','Hebron, IN','Momence, IL',
                'Peotone, IL','Wonder Lake, IL','Monee, IL','Union Township, Porter County, IN',
                'Hampshire, IL']

In [21]:
df.head()

,SalesDate,CoustomerId,SalesAmount,area,Year,Day,Month,weeks
0,10/18/2014,34810920,205.44,"Wonder Lake, IL",2014,18,10,42
1,9/22/2014,1026037818,51.36,"Westville, IN",2014,22,9,39
2,9/30/2014,1095693062,222.56,"Westville, IN",2014,30,9,40
3,10/25/2014,15142688,171.20,Chicago-Aurora-Elgin-Joliet-Waukegan,2014,25,10,43
4,10/18/2014,1022245368,171.20,"Lakes of the Four Seasons, IN",2014,18,10,42

In [6]:
df.shape

(1058198, 3)

In [7]:
df["area"] = np.random.choice(chicago_areas, size=len(df))

In [8]:
df.head()

   SALES_dATE  CUSTOMER_ID  SALES_AMOUNT                                  area
0  10/18/2014     34810920        205.44                       Wonder Lake, IL
1   9/22/2014   1026037818         51.36                         Westville, IN
2   9/30/2014   1095693062        222.56                         Westville, IN
3  10/25/2014     15142688        171.20  Chicago-Aurora-Elgin-Joliet-Waukegan
4  10/18/2014   1022245368        171.20         Lakes of the Four Seasons, IN

In [10]:
df.columns=['SalesDate','CoustomerId','SalesAmount','area']

In [11]:
df['Year'] = pd.DatetimeIndex(df['SalesDate']).year

In [12]:
df['Day'] = pd.DatetimeIndex(df['SalesDate']).day
df['Month'] = pd.DatetimeIndex(df['SalesDate']).month

In [13]:
weeks=[]
for i in range(1058198):
    weeks.append(datetime.date(df.loc[i,'Year'],df.loc[i,'Month'],df.loc[i,'Day']).isocalendar()[1])

In [14]:
df['weeks']=weeks

In [15]:
df.head()

,SalesDate,CoustomerId,SalesAmount,area,Year,Day,Month,weeks
0,10/18/2014,34810920,205.44,"Wonder Lake, IL",2014,18,10,42
1,9/22/2014,1026037818,51.36,"Westville, IN",2014,22,9,39
2,9/30/2014,1095693062,222.56,"Westville, IN",2014,30,9,40
3,10/25/2014,15142688,171.20,Chicago-Aurora-Elgin-Joliet-Waukegan,2014,25,10,43
4,10/18/2014,1022245368,171.20,"Lakes of the Four Seasons, IN",2014,18,10,42

In [22]:
Week_1=df[df['weeks']==38]
Week_1=Week_1.groupby('CoustomerId')['SalesAmount'].agg({'Statistical Measures':[np.mean,np.min,np.max,np.count_nonzero,np.std,np.sum]})
Week_1.columns=['Mean','Max','Min','Count','StandardDeviation','Total']
Week_1=Week_1.reset_index()

/home/jupyterlab/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

In [23]:
Week_2=df[df['weeks']==39]
Week_2=Week_2.groupby('CoustomerId')['SalesAmount'].agg({'Statistical Measures':[np.mean,np.min,np.max,np.count_nonzero,np.std,np.sum]})
Week_2.columns=['Mean','Max','Min','Count','StandardDeviation','Total']
Week_2=Week_2.reset_index()

/home/jupyterlab/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

In [24]:
Week_3=df[df['weeks']==40]
Week_3=Week_3.groupby('CoustomerId')['SalesAmount'].agg({'Statistical Measures':[np.mean,np.min,np.max,np.count_nonzero,np.std,np.sum]})
Week_3.columns=['Mean','Max','Min','Count','StandardDeviation','Total']
Week_3=Week_3.reset_index()

/home/jupyterlab/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

In [25]:
Week_4=df[df['weeks']==41]
Week_4=Week_4.groupby('CoustomerId')['SalesAmount'].agg({'Statistical Measures':[np.mean,np.min,np.max,np.count_nonzero,np.std,np.sum]})
Week_4.columns=['Mean','Max','Min','Count','StandardDeviation','Total']
Week_4=Week_4.reset_index()

/home/jupyterlab/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

In [26]:
Week_5=df[df['weeks']==42]
Week_5=Week_5.groupby('CoustomerId')['SalesAmount'].agg({'Statistical Measures':[np.mean,np.min,np.max,np.count_nonzero,np.std,np.sum]})
Week_5.columns=['Mean','Max','Min','Count','StandardDeviation','Total']
Week_5=Week_5.reset_index()

/home/jupyterlab/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

In [27]:
Week_6=df[df['weeks']==43]
Week_6=Week_6.groupby('CoustomerId')['SalesAmount'].agg({'Statistical Measures':[np.mean,np.min,np.max,np.count_nonzero,np.std,np.sum]})
Week_6.columns=['Mean','Max','Min','Count','StandardDeviation','Total']
Week_6=Week_6.reset_index()

/home/jupyterlab/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version

In [34]:
Week_0_5=Week_1.merge(Week_2,on='CoustomerId',how='outer').merge(Week_3,on='CoustomerId',how='outer').merge(Week_4,on='CoustomerId',how='outer').merge(Week_5,on='CoustomerId',how='outer')

In [35]:
Week_0_5.columns

Index(['CoustomerId', 'Mean_x', 'Max_x', 'Min_x', 'Count_x',
       'StandardDeviation_x', 'Total_x', 'Mean_y', 'Max_y', 'Min_y', 'Count_y',
       'StandardDeviation_y', 'Total_y', 'Mean_x', 'Max_x', 'Min_x', 'Count_x',
       'StandardDeviation_x', 'Total_x', 'Mean_y', 'Max_y', 'Min_y', 'Count_y',
       'StandardDeviation_y', 'Total_y', 'Mean', 'Max', 'Min', 'Count',
       'StandardDeviation', 'Total'],
      dtype='object')

In [30]:
Week_0_5.columns=['CustomerId','Mean_1','Max_1','Min_1','Count_1','StandardDeviation_1','Revenue_1','Mean_2','Max_2','Min_2','Count_2','StandardDeviation_2','Revenue_2','Mean_3','Max_3','Min_3','Count_3','StandardDeviation_3','Revenue_3','Mean_4','Max_4','Min_4','Count_4','StandardDeviation_4','Revenue_4','Mean_5','Max_5','Min_5','Count_5','StandardDeviation_5','Revenue_5']

In [31]:
Week_0_5.fillna(0,inplace=True)

In [32]:
Week_0_5['TotalRevenue']=Week_0_5['Revenue_1'] + Week_0_5['Revenue_2'] + Week_0_5['Revenue_3'] + Week_0_5['Revenue_4'] + Week_0_5['Revenue_5']

In [33]:
Week_0_5.head()

,CustomerId,Mean_1,Max_1,Min_1,Count_1,StandardDeviation_1,Revenue_1,Mean_2,Max_2,Min_2,...,Count_4,StandardDeviation_4,Revenue_4,Mean_5,Max_5,Min_5,Count_5,StandardDeviation_5,Revenue_5,TotalRevenue
0,7260,171.20,171.20,171.20,1.0,0.0,171.20,128.4,85.60,171.20,...,3.0,19.768473,445.12,145.52,68.48,171.20,4.0,51.360000,582.08,1968.80
1,11024,68.48,68.48,68.48,1.0,0.0,68.48,85.6,51.36,119.84,...,1.0,0.000000,51.36,59.92,51.36,68.48,2.0,12.105668,119.84,564.96
2,12476,51.36,51.36,51.36,1.0,0.0,51.36,0.0,0.00,0.00,...,1.0,0.000000,51.36,0.00,0.00,0.00,0.0,0.000000,0.00,154.08
3,14156,171.20,171.20,171.20,1.0,0.0,171.20,171.2,171.20,171.20,...,1.0,0.000000,171.20,171.20,171.20,171.20,1.0,0.000000,171.20,770.40
4,17606,171.20,171.20,171.20,1.0,0.0,171.20,0.0,0.00,0.00,...,0.0,0.000000,0.00,171.20,171.20,171.20,1.0,0.000000,171.20,342.40

In [74]:
Week_0_5.to_csv('FinalData.csv')